app/controllers/bookmkfolders_controller.rb

SELECT "bookmkfolders".* FROM "bookmkfolders" WHERE "bookmkfolders"."user_id" = 2 ORDER BY "bookmkfolders"."sequence" DESC
---
  def index
    @bookmkfolders = Bookmkfolder.where(user: current_user.id).order(sequence: :asc)

SELECT COUNT(*) FROM "bookmkfolders"
INSERT INTO "bookmkfolders" ("bookmkfoldertitle", "bookmkfoldercolor", "user_id", "created_at", "updated_at", "sequence") VALUES (?, ?, ?, ?, ?, ?)  [["bookmkfoldertitle", "eeee"], ["bookmkfoldercolor", "#c9ddff"], ["user_id", 1], ["created_at", "2017-08-15 06:49:32.894745"], ["updated_at", "2017-08-15 06:49:32.894745"], ["sequence", 5]]
---
  def createfolder
    colors = ['#c9ddff', '#c9ffdd', '#ffd2c9', '#c9caff', '#fdc9ff', '#fffdc9', '#c9fffc', '#ffc9c9', '#ffe5c9', '#eaffc9']
    @bookmkfolder = Bookmkfolder.new(bookmkfolder_params)
    @bookmkfolder.user = current_user
    @bookmkfolder.sequence = Bookmkfolder.count + 1
    @bookmkfolder.bookmkfoldercolor = colors.at(rand(colors.size))

    respond_to do |format|
      if @bookmkfolder.save

SELECT  "bookmkfolders".* FROM "bookmkfolders" WHERE "bookmkfolders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bookmkfolders" SET "sequence" = ?, "updated_at" = ? WHERE "bookmkfolders"."id" = ?  [["sequence", 1], ["updated_at", "2017-08-14 21:25:49.964877"], ["id", 1]]
---
  def sort
    folder = params[:sequence]
    puts params[:sequence]
    for i in 1..folder.size
        fold = Bookmkfolder.find(folder.at(i))
        fold.sequence = params[:sequence].index(i.to_s)
        fold.save

SELECT  "bookmkfolders".* FROM "bookmkfolders" WHERE "bookmkfolders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_bookmkfolder
      @bookmkfolder = Bookmkfolder.find(params[:id])