app/controllers/bookmkfolders_controller.rb

  def index
    @bookmkfolders = Bookmkfolder.all
---
SELECT  "bookmkfolders".* FROM "bookmkfolders" ORDER BY "bookmkfolders"."id" ASC LIMIT ?  [["LIMIT", 1]]