app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["content", "test"], ["user_id", 1], ["created_at", "2017-07-29 08:58:08.623933"], ["updated_at", "2017-07-29 08:58:08.623933"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "테스트테스트3333222222"], ["updated_at", "2017-07-29 10:31:24.501185"], ["id", 4]]
---
  def update
    authorize_action_for @post
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]
---
  def destroy
    authorize_action_for @post
    @post.destroy